# SetCreateAnalyticalModel Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
EnergyDataSettings..::..SetCreateAnalyticalModel Method
EnergyDataSettings Class See Also
---
If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetCreateAnalyticalModel(
	bool createAnalyticalModel
)
```

Visual Basic
---
```text
Public Sub SetCreateAnalyticalModel ( _
	createAnalyticalModel As Boolean _
)
```

Visual C++
---
```text
public:
void SetCreateAnalyticalModel(
	bool createAnalyticalModel
)
```

# ### Parameters
createAnalyticalModel
    Type: System..::..Boolean True to enable the Energy Analytical Model otherwise.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace